<template>
    <div
  class="animate__animated animate__rotateInDownLeft flex justify-center mt-20  bg-gradient-to-r from-pink-500 via-red-500 to-yellow-500 "
>
  <a class="animate__animated animate__rotateInDownLeft block rounded-xl bg-white p-6 sm:p-8" href="">
    <div class="mt-16 sm:pr-8">
      <h3 class="text-xl font-bold text-gray-900">Принцип работы</h3>

      <p class="mt-2 text-sm text-gray-500">
        Часто ли вы замечали различные проверки на "честность" на сайтах?
      </p>
      <p>
        Это может быть SHA256, random.org или, например, какая-нибудь соль.
      </p>
      <p>
        Но как правило, вся эта честность – только для вида.
      </p>
      <p class="mt-2 text-sm text-gray-600">Так почему же случайности на крашах не случайны?</p>
      <p>Подписчики часто рассказывают нам, что модераторы гемблингов уверяют их,<br/> что коэффициенты на их сайте генерируются случайным образом и что подкруток нет.</p>
    <p class="mt-2 text-sm text-gray-600">Случайные и псевдослучайные числа</p>
    <p>Случайные числа — это, по своей сути, нечто, что в данный момент сложно искусственно определить. </p>
    <p>Однако, существуют псевдослучайные числа (ГСПЧ),<br/> которые производят генераторы псевдослучайных чисел,<br/> которые, в свою очередь, основаны на методе Монте-Карло, криптографии,<br/> или имитационном моделировании.</p>
   <img class="animate__animated  animate__rotateInDownLeft" src="https://crashoff.net/_ipx/w_1536,f_webp,q_80/img/articles/workflow-1.jpg" alt="">
   <p class="mt-2 text-sm text-gray-900">Метод Монте-Карло</p>
   <img src="https://crashoff.net/_ipx/w_1536,f_webp,q_80/img/articles/workflow-2.jpg" alt="">
   <p class="mt-2 text-sm text-gray-900">Линейный конгруэнтный метод</p>
   <p>В программировании используются псевдослучайные числа,<br/> у которых имеется ряд требований для того,<br/> чтобы считаться (псевдо)случайными.<br/> Одно из этих условий звучит как: <br/>«Необходим достаточно длинный период, гарантирующий<br/> отсутствие зацикливания последовательности<br/> в пределах решаемой задачи.<br/> Длина периода должна быть математически доказана.».

Все мы знаем, насколько часто происходит <br/>генерация нового раунда на гемблингах,<br/> то есть, цикл в определенный момент замыкается.<br/> Это является одним из доказательств в пользу возможности<br/> атаки на генератор псевдослучайных чисел.

Теперь мы постараемся объяснить, <br/>что такое атака на генератор псевдослучайных чисел.</p>
<p class="mt-2 text-sm text-blue-800">Возможные тактики игры</p>
<p>1. По старинке – руководствуемся своими предположениями, которые построил мозг.</p>
<p>3. Не играть – лучше купите маме подарок.</p>
<p>2. Анализировать с помощью нашей нейросети – вам предоставляются полезные данные,<br/> которые помогут выстроить нужные причинно-следственные связи.
</p>
</div>
  </a>
</div>

</template>